#include <stdio.h>

float recursiva1(int n)
{ 
    if(n == 0) return 0;
    else if(n == 1) return 1.0;
    else return (1.0/n) + recursiva1(n-1);
}

int main()
{
    int n;

    scanf("%d", &n);

    printf("%f\n", recursiva1(n));

    return 0;
}

/*
***********************************************************************
* Elaborar um programa que leia um número N e calcule recursivamente, *
* o valor de: S = 1 + 1/2 + 1/3 +1/4 +...+ 1/N                        *
*                                                                     *
* |Exemplos de Entrada | Exemplos de Saída |                          *
* |0                   |0.000000           |                          *
* |                    |                   |                          *
* |--------------------|-------------------|                          *
* |1                   |1.000000           |                          *
* |                    |                   |                          *
* |--------------------|-------------------|                          *
* |2                   |1.500000           |                          *
* |                    |                   |                          *
* |--------------------|-------------------|                          *
* |3                   |1.833333           |                          *
* |                    |                   |                          *
* |--------------------|-------------------|                          *
***********************************************************************
*/
